================================================================================
Command alone
================================================================================

com
command

--------------------------------------------------------------------------------

(script_file
  (command_statement)
  (command_statement))

================================================================================
Command with name
================================================================================

com List
command ListCmd

--------------------------------------------------------------------------------

(script_file
  (command_statement
    name: (command_name))
  (command_statement
    name: (command_name)))

================================================================================
Command with repl
================================================================================

command Test call Test()
command ListCmd Echo error

--------------------------------------------------------------------------------

(script_file
  (command_statement
    name: (command_name)
    repl: (command
      (call_statement
        (call_expression
          function: (identifier)))))
  (command_statement
    name: (command_name)
    repl: (command
      (user_command
        (command_name)
        (arguments
          (command_argument))))))

================================================================================
Command with attribute
================================================================================

command -nargs=1 Error echo "There is an error"
com -nargs=1 -bang -complete=customlist,EditFileComplete Test call Test()

--------------------------------------------------------------------------------

(script_file
  (command_statement
    (command_attribute)
    name: (command_name)
    repl: (command
      (echo_statement
        (string_literal)))) 
  (command_statement
    (command_attribute)
    (command_attribute)
    (command_attribute
      (identifier))
    name: (command_name)
    repl: (command
      (call_statement
        (call_expression
          function: (identifier))))))
